controllers/SiteController.php

SELECT * FROM `category` ORDER BY `id` DESC
SELECT COUNT(*) FROM `post` WHERE (`category_id`=3) AND (`status`='1')
---
    public function actionCategory()
    {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $list = Category::find()->orderBy([ 'id' => SORT_DESC])->all();
        $data = [];
        $i = 1;
        foreach ($list as $key => $value) {
            $data[$key]['id'] = $value['id'];
            $data[$key]['name'] = $value['title'];
            $data[$key]['href'] = "#";
            $data[$key]['thumbnail'] = "https://images.unsplash.com/photo-1536329583941-14287ec6fc4e?ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTF8fGRlc2lnbnxlbnwwfHwwfHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60";
            $data[$key]['count'] = Post::find()->andWhere(['category_id' => $value['id'], 'status' => '1'])->count();;

SELECT `product`.* FROM `product` LEFT JOIN `category` ON `product`.`category_id` = `category`.`id` ORDER BY `id` DESC, `status`
---
    public function actionProduct()
    {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $list = Product::find()->joinWith(['category'])->orderBy([ 'id' => SORT_DESC, 'status' => '1'])->all();

SELECT * FROM `product` WHERE (`id`=1) AND (`status`='1')
---
    public function actionProductview()
    {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $request = Yii::$app->request;
        $params = json_decode($request->getRawBody());
        $id = $params->id->id;
        $list = Product::findOne(['id' => $id, 'status'=>'1']);